geSurfaceProp(OdGeSurface!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.NurbSurfaceProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.NurbSurfaceProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Calculates a properties for a specified surface.
\param pS [in]  Any surface.
\param propU, propV [out] Receives the properties.
\param tol [in] Geometric tolerance.
Corresponding C++ library: TD_Ge
\remarks
Rational state valid only for NURB surfaces.